In [2]:
import pandas as pd
alunos_dic = { 'Nome' : ['Rodrigo', 'Fernanda', 'Pedro', 'Roberto', 'Carlos'], 
          'Nota': [9, 8.5, 6, 5, 7],
          'Aprovado': ['Sim', 'Sim', 'Não', 'Não', 'Sim']}

Transformar um dicionário em um DF

In [3]:
alunos_df = pd.DataFrame(alunos_dic)
alunos_df.head()

       Nome  Nota Aprovado
0   Rodrigo   9.0      Sim
1  Fernanda   8.5      Sim
2     Pedro   6.0      Não
3   Roberto   5.0      Não
4    Carlos   7.0      Sim

In [4]:
alunos_df.shape

(5, 3)

In [5]:
alunos_df.describe()

          Nota
count  5.00000
mean   7.10000
std    1.67332
min    5.00000
25%    6.00000
50%    7.00000
75%    8.50000
max    9.00000

In [6]:
alunos_df['Nome']

0     Rodrigo
1    Fernanda
2       Pedro
3     Roberto
4      Carlos
Name: Nome, dtype: object

In [7]:
alunos_df.loc[0:2]

       Nome  Nota Aprovado
0   Rodrigo   9.0      Sim
1  Fernanda   8.5      Sim
2     Pedro   6.0      Não

In [8]:
alunos_df.iloc[1]

Nome        Fernanda
Nota             8.5
Aprovado         Sim
Name: 1, dtype: object

Filtrando a coluna Nota, verificando se o valor e igual há um valor especifico. Em seguida, localiza a linha referente a condição anteriormente passada.

In [9]:
alunos_df.loc[alunos_df['Aprovado'] == 'Sim']

       Nome  Nota Aprovado
0   Rodrigo   9.0      Sim
1  Fernanda   8.5      Sim
4    Carlos   7.0      Sim